package homework8;

public class Main {
    public static void main(String[] args) {
        while (true){
            System.out.println("1 - Перевірити чи є такий місяць\n" +//(місяць вводимо з консолі, передбачити, щоб регістр букв був неважливим )
                    "2 - Вивести всі місяці з такою ж порою року\n" +
                    "3 - Вивести всі місяці які мають таку саму кількість днів\n" +
                    "4 - Вивести на екран всі місяці які мають меншу кількість днів\n" +
                    "5 - Вивести на екран всі місяці які мають більшу кількість днів\n" +
                    "6 - Вивести на екран наступну пору року\n" +
                    "7 - Вивести на екран попередню пору року\n" +
                    "8 - Вивести на екран всі місяці які мають парну кількість днів\n" +
                    "9 - Вивести на екран всі місяці які мають непарну кількість днів\n" +
                    "0 - Вивести на екран чи введений з консолі місяць має парну кількість днів");
            break;
        }
    }
}
