/**
 1. Оголосіть дві змінні admin та name.
 В змінну name запишіть значення 'John'.
 Скопіюйте значення змінної name в змінну admin.
 Виведіть значення змінної admin на консоль.

 2. Використовуючи конструкцію if-else створіть зміннi login та password.
 Після присвоєння їм одного значень повинні відбуватись дії згідно блок-схеми малюнку JS-task-2.PNG (малюнок додано).
 Виводити в консоль.

 3. Створіть порожній об'єкт user.
 Додайте властивість name зі значенням ПИЛИП.
 Додайте властивість surname зі значенням ШЕВЧЕНКО.
 Поміняйте значення name на СЕРГІЙ.
 Видаліть властивість name з об'єкта.

 4. Є об'єкт employeeSalaries із зарплатами працівників.
 Напишіть код, який виведе суму всіх зарплат працівників.
 Якщо об'єкт порожній, то результат повинен бути 0.

 5. Напишіть функцію, яка прийматиме два числа і тип операції над ними (множення ділення, додавання віднімання).
 Передбачити відловлювання exceptions за умови некоретних вхідних даних.

 6. Переписати завдання 2 використовуючи конструкцію switch.
 */
