package streams.zoo;

public abstract class Menu {

    public static void printMenu(){
        System.out.print("\n" +
                "1 - Додати учасника клубу\n" +
                "2 - Додати тваринку до учасника клубу\n" +
                "3 - Видалити тваринку з учасника клубу\n" +
                "4 - Видалити учасника з клубу\n" +
                "5 - Видалити конкретну тваринку зі всіх власників\n" +
                "6 - Вивести на екран зооклуб\n" +
                "0 - Вийти з програми\n" +
                "\n" +
                "Ввід: ");
    }
}
