package SetQueue;

public class Commodity {

//    2) Створити клас Commodity.
//    Описати даний клас: поля методи.
//    Повинні бути такі методи:
//    Додати товар
//    Видалити товар
//    Замінити товар
//    Сортувати за назвоню
//    Сортувати за довжиною
//    Сортувати за шириною
//    Сортувати за вагою
//    Виводимо і-тий елемент колекції(який ми вводимо з консолі(використовуємо Scanner))
//    Вийти з програми(підказка System.exit)
//
//    Для меню використати Switch.
//    Продемонструвати як виконується кожен метод над списком і
//    виводити список після змін в ньому.


}
